backend/controllers/ArtikelController.php

INSERT INTO `artikel` (`judul`, `id_kategori`, `headline`, `isi_berita`, `gambar`, `tag`, `username`, `tanggal`, `jam`) VALUES ('Test Headline', 19, 'Y', '<p>Lorem Ipsum is</p>', 'Blue hills.jpg', '', 'cipto123', '2015-03-30', '10:54:14')
---
    public function actionCreate()
    {
        $model = new Artikel();
        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
           	$model->gambar = UploadedFile::getInstance($model, 'gambar');
			$model->username=Yii::$app->user->identity->username;
			$model->tanggal=date("Y-m-d");
			$model->jam=date("H:i:s");
			$model->save();