backend/views/artikel/_form.php


    <?php
	//use app\models\Country;
	$kategori=Kategori::find()->all();
---
SELECT * FROM `kategori`